; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype microwavetype fridgetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   coffeetabletype bedtype drawertype carttype diningtabletype - receptacletype
   breadtype wateringcantype bowltype cellphonetype mugtype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   coffeetable_1 bed_2 drawer_3 cart_4 diningtable_5 microwave_6 fridge_7 - receptacle
   bread_1 wateringcan_2 bowl_3 cellphone_4 mug_5 - obj
 )
 (:init (receptacletype_0 coffeetable_1 coffeetabletype) (receptacletype_0 bed_2 bedtype) (receptacletype_0 drawer_3 drawertype) (receptacletype_0 cart_4 carttype) (receptacletype_0 diningtable_5 diningtabletype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 bread_1 breadtype) (objecttype_0 wateringcan_2 wateringcantype) (objecttype_0 bowl_3 bowltype) (objecttype_0 cellphone_4 cellphonetype) (objecttype_0 mug_5 mugtype) (cancontain coffeetabletype breadtype) (cancontain coffeetabletype wateringcantype) (cancontain coffeetabletype bowltype) (cancontain coffeetabletype cellphonetype) (cancontain coffeetabletype mugtype) (cancontain bedtype cellphonetype) (cancontain drawertype wateringcantype) (cancontain drawertype cellphonetype) (cancontain carttype mugtype) (cancontain diningtabletype breadtype) (cancontain diningtabletype wateringcantype) (cancontain diningtabletype bowltype) (cancontain diningtabletype cellphonetype) (cancontain diningtabletype mugtype) (cancontain microwavetype breadtype) (cancontain microwavetype bowltype) (cancontain microwavetype mugtype) (cancontain fridgetype breadtype) (cancontain fridgetype bowltype) (cancontain fridgetype mugtype) (pickupable bread_1) (heatable bread_1) (coolable bread_1) (sliceable bread_1) (pickupable wateringcan_2) (pickupable bowl_3) (isreceptacleobject bowl_3) (cleanable bowl_3) (coolable bowl_3) (pickupable cellphone_4) (pickupable mug_5) (isreceptacleobject mug_5) (cleanable mug_5) (heatable mug_5) (coolable mug_5) (receptacleatlocation coffeetable_1 location5) (receptacleatlocation bed_2 location5) (receptacleatlocation drawer_3 location3) (receptacleatlocation cart_4 location1) (receptacleatlocation diningtable_5 location1) (receptacleatlocation microwave_6 location4) (receptacleatlocation fridge_7 location3) (inreceptacle bread_1 coffeetable_1) (inreceptacle wateringcan_2 diningtable_5) (inreceptacle bowl_3 microwave_6) (inreceptacle cellphone_4 drawer_3) (inreceptacle mug_5 microwave_6) (objectatlocation bread_1 location5) (objectatlocation wateringcan_2 location1) (objectatlocation bowl_3 location4) (objectatlocation cellphone_4 location3) (objectatlocation mug_5 location4) (atlocation agent1 location4) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o1 - obj)
 (and (inreceptacle ?o1 ?r) (objecttype_0 ?o1 mugtype) (receptacletype_0 ?r diningtabletype) (exists (?o2 - obj)
 (and (not (= ?o1 ?o2)) (objecttype_0 ?o2 bowltype) (receptacletype_0 ?r diningtabletype) (inreceptacle ?o2 ?r))))))))
 (:metric minimize (total-cost))
)

; plan
1. (pickupobject agent1 location4 bowl_3 microwave_6)
   deleted: (inreceptacle bowl_3 microwave_6) (objectatlocation bowl_3 location4)
   added: (holds agent1 bowl_3) (holdsany agent1)
   goals met: 0 of 1
2. (gotolocation agent1 location4 location1)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
3. (putobject agent1 location1 bowl_3 diningtable_5 bowltype diningtabletype)
   deleted: (holds agent1 bowl_3) (holdsany agent1)
   added: (inreceptacle bowl_3 diningtable_5) (objectatlocation bowl_3 location1)
   goals met: 0 of 1
4. (gotolocation agent1 location1 location4)
   deleted: (atlocation agent1 location1)
   added: (atlocation agent1 location4)
   goals met: 0 of 1
5. (pickupobject agent1 location4 mug_5 microwave_6)
   deleted: (inreceptacle mug_5 microwave_6) (objectatlocation mug_5 location4)
   added: (holds agent1 mug_5) (holdsany agent1)
   goals met: 0 of 1
6. (gotolocation agent1 location4 location1)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
7. (putobject agent1 location1 mug_5 diningtable_5 mugtype diningtabletype)
   deleted: (holds agent1 mug_5) (holdsany agent1)
   added: (inreceptacle mug_5 diningtable_5) (objectatlocation mug_5 location1)
   goals met: 1 of 1
